## Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of _reductions_ or _summary statistics_, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. Compared with the equivalent methods of vanilla NumPy arrays, they are all built from the ground up to exclude missing data. Consider
a small DataFrame:

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
.....: [np.nan, np.nan], [0.75, -1.3]],
.....: index=['a', 'b', 'c', 'd'],
.....: columns=['one', 'two'])

In [5]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [6]:
df.sum() #column sums

one    9.25
two   -5.80
dtype: float64

In [7]:
df.sum(axis=1) #rows sum

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [8]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods, like `idxmin` and `idxmax`, return indirect statistics like the index value where the minimum or maximum values are attained:

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [11]:
df.describe() #summary statistics

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [12]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [13]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

Some summary statistics, like correlation and covariance, are computed from pairs of arguments. Let’s consider some DataFrames of stock prices and volumes obtained from
**Yahoo! Finance**:

In [14]:
from pandas.io.data import DataReader

/home/kia/anaconda3/lib/python3.5/site-packages/pandas/io/data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [15]:
import datetime

In [16]:
all_data = {}
start = datetime.datetime(2000, 1, 1)
end = datetime.datetime(2010, 1, 1)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = DataReader(ticker, 'yahoo', start, end)

As you are in python3 , use dict.items() instead of dict.iteritems()
iteritems() was removed in python3, so you can't use this method anymore.

In Built-in Changes part, it is stated that:

+ Removed dict.iteritems(), dict.iterkeys(), and dict.itervalues().
+ Instead: use dict.items(), dict.keys(), and dict.values() respectively.

In [17]:
price = DataFrame({tic: data['Adj Close']
                    for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [18]:
returns = price.pct_change()

In [19]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [20]:
returns.MSFT.corr(returns.IBM)

0.49597968454928881

In [21]:
returns.MSFT.cov(returns.IBM)

0.00021595764843398285

In [22]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [23]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [24]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [25]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

#### Unique Values, Value Counts, and Membership

In [26]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [27]:
uniques = obj.unique()

In [28]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [29]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [30]:
pd.value_counts(obj.values, sort = False)

d    1
c    3
a    3
b    2
dtype: int64

`isin` is responsible for vectorized set membership and can be very useful in filtering a data set down to a subset of values in a Series or column in a DataFrame:

In [31]:
mask = obj.isin(['b', 'c'])

In [32]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [33]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

computing a histogram on multiple related columns in a DataFrame.

In [34]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
.....: 'Qu2': [2, 3, 1, 2, 3],
.....: 'Qu3': [1, 5, 2, 4, 4]})

In [35]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [36]:
result = data.apply(pd.value_counts).fillna(0)

In [37]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### Handling Missing Data

all of the descriptive statistics on pandas objects exclude missing data as you’ve seen earlier in the chapter.

In [38]:
from numpy import nan as NA

In [39]:
data = Series([1, NA, 3.5, NA, 7])

In [40]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [41]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, these are a bit more complex. You may want to drop rows or columns which are all NA or just those containing any NAs. `dropna` by default drops any row containing a missing value:

In [42]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
.....: [NA, NA, NA], [NA, 6.5, 3.]])

In [43]:
cleaned = data.dropna()

In [44]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [45]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [46]:
data[4] = NA

In [47]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [48]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

A related way to filter out DataFrame rows tends to concern time series data. Suppose you want to keep only rows containing a certain number of observations. You can indicate this with the `thresh` argument:

In [49]:
df = DataFrame(np.random.randn(7, 3))

In [50]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

In [51]:
df

          0         1         2
0 -1.019793       NaN       NaN
1 -0.661092       NaN       NaN
2  0.471322       NaN       NaN
3 -2.623811       NaN  0.372822
4  1.912235       NaN  1.960153
5  0.449011 -1.172542 -1.878797
6 -2.265136  0.080339  0.483458

In [52]:
df.dropna(thresh=3)

          0         1         2
5  0.449011 -1.172542 -1.878797
6 -2.265136  0.080339  0.483458

#### Filling in Missing data

Calling `fillna` with a constant replaces missing values with that value:

In [53]:
df.fillna(0)

          0         1         2
0 -1.019793  0.000000  0.000000
1 -0.661092  0.000000  0.000000
2  0.471322  0.000000  0.000000
3 -2.623811  0.000000  0.372822
4  1.912235  0.000000  1.960153
5  0.449011 -1.172542 -1.878797
6 -2.265136  0.080339  0.483458

In [54]:
df.fillna({1: 0.5, 2: -1}) #fillna with a dict for each column

          0         1         2
0 -1.019793  0.500000 -1.000000
1 -0.661092  0.500000 -1.000000
2  0.471322  0.500000 -1.000000
3 -2.623811  0.500000  0.372822
4  1.912235  0.500000  1.960153
5  0.449011 -1.172542 -1.878797
6 -2.265136  0.080339  0.483458

`fillna` returns a new object, but you can modify the existing object in place:

In [55]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)

In [56]:
df

          0         1         2
0 -1.019793  0.000000  0.000000
1 -0.661092  0.000000  0.000000
2  0.471322  0.000000  0.000000
3 -2.623811  0.000000  0.372822
4  1.912235  0.000000  1.960153
5  0.449011 -1.172542 -1.878797
6 -2.265136  0.080339  0.483458

In [57]:
_ #temporary object just a notation

          0         1         2
0 -1.019793  0.000000  0.000000
1 -0.661092  0.000000  0.000000
2  0.471322  0.000000  0.000000
3 -2.623811  0.000000  0.372822
4  1.912235  0.000000  1.960153
5  0.449011 -1.172542 -1.878797
6 -2.265136  0.080339  0.483458

In [58]:
df = DataFrame(np.random.randn(6, 3))

In [59]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [60]:
df

          0         1         2
0  0.351822  1.196826  0.031425
1  1.023215  1.950118 -0.490225
2  0.412863       NaN -0.146037
3  0.254262       NaN  1.151877
4 -1.661740       NaN       NaN
5 -0.737066       NaN       NaN

In [61]:
df.fillna(method='ffill') #fills up column based on the last cell

          0         1         2
0  0.351822  1.196826  0.031425
1  1.023215  1.950118 -0.490225
2  0.412863  1.950118 -0.146037
3  0.254262  1.950118  1.151877
4 -1.661740  1.950118  1.151877
5 -0.737066  1.950118  1.151877

In [62]:
df.fillna(method='ffill', limit=2) #fills up 2 more cells

          0         1         2
0  0.351822  1.196826  0.031425
1  1.023215  1.950118 -0.490225
2  0.412863  1.950118 -0.146037
3  0.254262  1.950118  1.151877
4 -1.661740       NaN  1.151877
5 -0.737066       NaN  1.151877

In [63]:
data = Series([1., NA, 3.5, NA, 7])

In [64]:
data.fillna(data.mean()) # filling NA with mean

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Hierarchical Indexing

_Hierarchical indexing_ is an important feature of pandas enabling you to have multiple (two or more) index levels on an axis. Somewhat abstractly, it provides a way for you to work with higher dimensional data in a lower dimensional form.

In [65]:
data = Series(np.random.randn(10),
.....: index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
.....: [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [66]:
data

a  1   -0.095137
   2   -1.842546
   3    0.714005
b  1   -0.711345
   2   -1.399605
   3   -0.443076
c  1   -0.948721
   2    0.614123
d  2    0.134618
   3    0.338887
dtype: float64

In [68]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [69]:
data['b']

1   -0.711345
2   -1.399605
3   -0.443076
dtype: float64

In [70]:
data['b':'c']

b  1   -0.711345
   2   -1.399605
   3   -0.443076
c  1   -0.948721
   2    0.614123
dtype: float64

In [71]:
data.ix[['b', 'd']]

b  1   -0.711345
   2   -1.399605
   3   -0.443076
d  2    0.134618
   3    0.338887
dtype: float64

In [72]:
data[:, 2] # selecting from an "inner" level

a   -1.842546
b   -1.399605
c    0.614123
d    0.134618
dtype: float64

__Hierarchical indexing plays a critical role in reshaping data and group-based operations like forming a pivot table. For example, this data could be rearranged into a DataFrame using its `unstack` method:__

In [73]:
data.unstack()

          1         2         3
a -0.095137 -1.842546  0.714005
b -0.711345 -1.399605 -0.443076
c -0.948721  0.614123       NaN
d       NaN  0.134618  0.338887

In [74]:
data.unstack().stack()

a  1   -0.095137
   2   -1.842546
   3    0.714005
b  1   -0.711345
   2   -1.399605
   3   -0.443076
c  1   -0.948721
   2    0.614123
d  2    0.134618
   3    0.338887
dtype: float64

In [75]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
.....: index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
.....: columns=[['Ohio', 'Ohio', 'Colorado'],
.....: ['Green', 'Red', 'Green']])

In [76]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [77]:
frame.index.names = ['key1', 'key2']

In [78]:
frame.columns.names = ['state', 'color']

In [79]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### Reordering and Sorting Levels

The `swaplevel` takes two level numbers or names and returns a new object with the levels interchanged (but the data is otherwise unaltered):

In [81]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [82]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [83]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### Summary Statistics by Level

In [85]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [86]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#### Using DataFrame's Columns

It’s not unusual to want to use one or more columns from a DataFrame as the row index; alternatively, you may wish to move the row index into the DataFrame’s columns.

In [87]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
.....: 'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
.....: 'd': [0, 1, 2, 0, 1, 2, 3]})

In [88]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [89]:
frame2 = frame.set_index(['c', 'd'])

In [90]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [91]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [92]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1